## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/5ed41fcd-6098-41a2-bbc2-d1212994c7b6/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.budget.azurerm_consumption_budget_resource_group.budget will be created
  + resource "azurerm_consumption_budget_resource_group" "budget" {
      + amount            = 200
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "Biotrackr-Budget"
      + resource_group_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae"
      + time_grain        = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceGroupName"
              + operator = "In"
              + values   = [
                  + "rg-biotrackr-prod-ae",
                ]
            }
        }

      + notification {
          + contact_emails = []
          + contact_groups = (known after apply)
          + contact_roles  = []
          + enabled        = true
          + operator       = "EqualTo"
          + threshold      = 150
          + threshold_type = "ActualCost"
        }
      + notification {
          + contact_emails = []
          + contact_groups = (known after apply)
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 190
          + threshold_type = "ActualCost"
        }

      + time_period {
          + end_date   = "2094-09-01T00:00:00Z"
          + start_date = "2024-09-01T00:00:00Z"
        }
    }

  # module.mag.azurerm_monitor_action_group.amg will be created
  + resource "azurerm_monitor_action_group" "amg" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Biotrackr-Action-Group"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + short_name          = "BAG"
      + tags                = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + email_receiver {
          + email_address           = "willvelida@hotmail.co.uk"
          + name                    = "Will Velida (Biotrackr)"
          + use_common_alert_schema = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.budget.azurerm_consumption_budget_resource_group.budget will be created%0A  + resource "azurerm_consumption_budget_resource_group" "budget" {%0A      + amount            = 200%0A      + etag              = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "Biotrackr-Budget"%0A      + resource_group_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae"%0A      + time_grain        = "Monthly"%0A%0A      + filter {%0A          + dimension {%0A              + name     = "ResourceGroupName"%0A              + operator = "In"%0A              + values   = [%0A                  + "rg-biotrackr-prod-ae",%0A                ]%0A            }%0A        }%0A%0A      + notification {%0A          + contact_emails = []%0A          + contact_groups = (known after apply)%0A          + contact_roles  = []%0A          + enabled        = true%0A          + operator       = "EqualTo"%0A          + threshold      = 150%0A          + threshold_type = "ActualCost"%0A        }%0A      + notification {%0A          + contact_emails = []%0A          + contact_groups = (known after apply)%0A          + contact_roles  = []%0A          + enabled        = true%0A          + operator       = "GreaterThan"%0A          + threshold      = 190%0A          + threshold_type = "ActualCost"%0A        }%0A%0A      + time_period {%0A          + end_date   = "2094-09-01T00:00:00Z"%0A          + start_date = "2024-09-01T00:00:00Z"%0A        }%0A    }%0A%0A  # module.mag.azurerm_monitor_action_group.amg will be created%0A  + resource "azurerm_monitor_action_group" "amg" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + location            = "global"%0A      + name                = "Biotrackr-Action-Group"%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + short_name          = "BAG"%0A      + tags                = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + email_receiver {%0A          + email_address           = "willvelida@hotmail.co.uk"%0A          + name                    = "Will Velida (Biotrackr)"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>